tutorials/CFD/21unsteadyNSTurb_RBF/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "50";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
11644
(
0.159122
4.65556
4.6561
4.6561
4.6561
4.6561
4.6561
4.6561
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 5;
    }
    outlet
    {
        type            zeroGradient;
    }
    down
    {
        type            empty;
    }
    up
    {
        type            empty;
    }
    sides
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        blended         false;
        value           nonuniform List<scalar> 
200
(
0.159122
0.15912
0.15874
0.158748
0.158355
0.158375
0.157958
0.157979
...
)
;
    }
    cylinder1
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        blended         false;
        value           nonuniform List<scalar> 
318
(
83.1192
122.065
122.016
168.352
217.585
54.614
60.4354
54.614
...
)
;
    }
}


// ************************************************************************* //
